Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxHsct_bf.h
/** \brief Mask for Ifx_HSCT_TESTCTRL_Bits.PRBSEN */
#define IFX_HSCT_TESTCTRL_PRBSEN_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_TESTCTRL_Bits.PRBSEN */
#define IFX_HSCT_TESTCTRL_PRBSEN_OFF (3u)

/** \brief Length for Ifx_HSCT_TESTMON_Bits.TRXCORS0 */
#define IFX_HSCT_TESTMON_TRXCORS0_LEN (2u)

/** \brief Mask for Ifx_HSCT_TESTMON_Bits.TRXCORS0 */
#define IFX_HSCT_TESTMON_TRXCORS0_MSK (0x3u)

/** \brief Offset for Ifx_HSCT_TESTMON_Bits.TRXCORS0 */
#define IFX_HSCT_TESTMON_TRXCORS0_OFF (0u)

/** \brief Length for Ifx_HSCT_TESTMON_Bits.TRXCORS1 */
#define IFX_HSCT_TESTMON_TRXCORS1_LEN (2u)

/** \brief Mask for Ifx_HSCT_TESTMON_Bits.TRXCORS1 */
#define IFX_HSCT_TESTMON_TRXCORS1_MSK (0x3u)

/** \brief Offset for Ifx_HSCT_TESTMON_Bits.TRXCORS1 */
#define IFX_HSCT_TESTMON_TRXCORS1_OFF (2u)

/** \brief Length for Ifx_HSCT_TESTMON_Bits.TRXCORS2 */
#define IFX_HSCT_TESTMON_TRXCORS2_LEN (2u)

/** \brief Mask for Ifx_HSCT_TESTMON_Bits.TRXCORS2 */
#define IFX_HSCT_TESTMON_TRXCORS2_MSK (0x3u)

/** \brief Offset for Ifx_HSCT_TESTMON_Bits.TRXCORS2 */
#define IFX_HSCT_TESTMON_TRXCORS2_OFF (4u)

/** \brief Length for Ifx_HSCT_TESTMON_Bits.TRXCORS3 */
#define IFX_HSCT_TESTMON_TRXCORS3_LEN (2u)

/** \brief Mask for Ifx_HSCT_TESTMON_Bits.TRXCORS3 */
#define IFX_HSCT_TESTMON_TRXCORS3_MSK (0x3u)

/** \brief Offset for Ifx_HSCT_TESTMON_Bits.TRXCORS3 */
#define IFX_HSCT_TESTMON_TRXCORS3_OFF (6u)

/** \brief Length for Ifx_HSCT_TESTMON_Bits.TRXCORS4 */
#define IFX_HSCT_TESTMON_TRXCORS4_LEN (2u)

/** \brief Mask for Ifx_HSCT_TESTMON_Bits.TRXCORS4 */
#define IFX_HSCT_TESTMON_TRXCORS4_MSK (0x3u)

/** \brief Offset for Ifx_HSCT_TESTMON_Bits.TRXCORS4 */
#define IFX_HSCT_TESTMON_TRXCORS4_OFF (8u)

/** \brief Length for Ifx_HSCT_TESTMON_Bits.TRXSYNC */
#define IFX_HSCT_TESTMON_TRXSYNC_LEN (1u)

/** \brief Mask for Ifx_HSCT_TESTMON_Bits.TRXSYNC */
#define IFX_HSCT_TESTMON_TRXSYNC_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_TESTMON_Bits.TRXSYNC */
#define IFX_HSCT_TESTMON_TRXSYNC_OFF (10u)

/** \brief Length for Ifx_HSCT_TESTMON_Bits.TTXFL */
#define IFX_HSCT_TESTMON_TTXFL_LEN (1u)

/** \brief Mask for Ifx_HSCT_TESTMON_Bits.TTXFL */
#define IFX_HSCT_TESTMON_TTXFL_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_TESTMON_Bits.TTXFL */
#define IFX_HSCT_TESTMON_TTXFL_OFF (11u)

/** \brief Length for Ifx_HSCT_TESTMON_Bits.LDBGSP */
#define IFX_HSCT_TESTMON_LDBGSP_LEN (3u)

/** \brief Mask for Ifx_HSCT_TESTMON_Bits.LDBGSP */
#define IFX_HSCT_TESTMON_LDBGSP_MSK (0x7u)

/** \brief Offset for Ifx_HSCT_TESTMON_Bits.LDBGSP */
#define IFX_HSCT_TESTMON_LDBGSP_OFF (12u)

/** \brief Length for Ifx_HSCT_TESTMON_Bits.LDBGCOROT */
#define IFX_HSCT_TESTMON_LDBGCOROT_LEN (1u)

/** \brief Mask for Ifx_HSCT_TESTMON_Bits.LDBGCOROT */
#define IFX_HSCT_TESTMON_LDBGCOROT_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_TESTMON_Bits.LDBGCOROT */
#define IFX_HSCT_TESTMON_LDBGCOROT_OFF (15u)

/** \brief Length for Ifx_HSCT_TESTMON_Bits.LDBGSPT */
#define IFX_HSCT_TESTMON_LDBGSPT_LEN (1u)

/** \brief Mask for Ifx_HSCT_TESTMON_Bits.LDBGSPT */
#define IFX_HSCT_TESTMON_LDBGSPT_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_TESTMON_Bits.LDBGSPT */
#define IFX_HSCT_TESTMON_LDBGSPT_OFF (16u)

/** \brief Length for Ifx_HSCT_TESTMON_Bits.LDBGRXSLS */
#define IFX_HSCT_TESTMON_LDBGRXSLS_LEN (1u)

/** \brief Mask for Ifx_HSCT_TESTMON_Bits.LDBGRXSLS */
#define IFX_HSCT_TESTMON_LDBGRXSLS_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_TESTMON_Bits.LDBGRXSLS */
#define IFX_HSCT_TESTMON_LDBGRXSLS_OFF (17u)

/** \brief Length for Ifx_HSCT_TESTMON_Bits.LDBGCORO */
#define IFX_HSCT_TESTMON_LDBGCORO_LEN (5u)

/** \brief Mask for Ifx_HSCT_TESTMON_Bits.LDBGCORO */
#define IFX_HSCT_TESTMON_LDBGCORO_MSK (0x1fu)

/** \brief Offset for Ifx_HSCT_TESTMON_Bits.LDBGCORO */
#define IFX_HSCT_TESTMON_LDBGCORO_OFF (18u)

/** \brief Length for Ifx_HSCT_TESTMON_Bits.HSCTMON */
#define IFX_HSCT_TESTMON_HSCTMON_LEN (9u)

/** \brief Mask for Ifx_HSCT_TESTMON_Bits.HSCTMON */
#define IFX_HSCT_TESTMON_HSCTMON_MSK (0x1ffu)

/** \brief Offset for Ifx_HSCT_TESTMON_Bits.HSCTMON */
#define IFX_HSCT_TESTMON_HSCTMON_OFF (23u)

/** \brief Length for Ifx_HSCT_OCS_Bits.TGS */
#define IFX_HSCT_OCS_TGS_LEN (2u)

/** \brief Mask for Ifx_HSCT_OCS_Bits.TGS */
#define IFX_HSCT_OCS_TGS_MSK (0x3u)

/** \brief Offset for Ifx_HSCT_OCS_Bits.TGS */
#define IFX_HSCT_OCS_TGS_OFF (0u)

/** \brief Length for Ifx_HSCT_OCS_Bits.TGB */
#define IFX_HSCT_OCS_TGB_LEN (1u)

/** \brief Mask for Ifx_HSCT_OCS_Bits.TGB */
#define IFX_HSCT_OCS_TGB_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_OCS_Bits.TGB */
#define IFX_HSCT_OCS_TGB_OFF (2u)

/** \brief Length for Ifx_HSCT_OCS_Bits.TG_P */
#define IFX_HSCT_OCS_TG_P_LEN (1u)

/** \brief Mask for Ifx_HSCT_OCS_Bits.TG_P */
#define IFX_HSCT_OCS_TG_P_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_OCS_Bits.TG_P */
#define IFX_HSCT_OCS_TG_P_OFF (3u)

/** \brief Length for Ifx_HSCT_OCS_Bits.SUS */
#define IFX_HSCT_OCS_SUS_LEN (4u)

/** \brief Mask for Ifx_HSCT_OCS_Bits.SUS */
#define IFX_HSCT_OCS_SUS_MSK (0xfu)

/** \brief Offset for Ifx_HSCT_OCS_Bits.SUS */
#define IFX_HSCT_OCS_SUS_OFF (24u)

/** \brief Length for Ifx_HSCT_OCS_Bits.SUS_P */
#define IFX_HSCT_OCS_SUS_P_LEN (1u)

/** \brief Mask for Ifx_HSCT_OCS_Bits.SUS_P */
#define IFX_HSCT_OCS_SUS_P_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_OCS_Bits.SUS_P */
#define IFX_HSCT_OCS_SUS_P_OFF (28u)

/** \brief Length for Ifx_HSCT_OCS_Bits.SUSSTA */
#define IFX_HSCT_OCS_SUSSTA_LEN (1u)

/** \brief Mask for Ifx_HSCT_OCS_Bits.SUSSTA */
#define IFX_HSCT_OCS_SUSSTA_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_OCS_Bits.SUSSTA */
#define IFX_HSCT_OCS_SUSSTA_OFF (29u)

/** \brief Length for Ifx_HSCT_KRSTCLR_Bits.CLR */
#define IFX_HSCT_KRSTCLR_CLR_LEN (1u)

/** \brief Mask for Ifx_HSCT_KRSTCLR_Bits.CLR */
#define IFX_HSCT_KRSTCLR_CLR_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_KRSTCLR_Bits.CLR */
#define IFX_HSCT_KRSTCLR_CLR_OFF (0u)

/** \brief Length for Ifx_HSCT_KRST1_Bits.RST */
#define IFX_HSCT_KRST1_RST_LEN (1u)

/** \brief Mask for Ifx_HSCT_KRST1_Bits.RST */
#define IFX_HSCT_KRST1_RST_MSK (0x1u)

